apache/nuttx/arch/arm/src/sam34/hardware/sam4l_usart.h
/* USART register bit definitions ***************************************************************/

/* USART Control Register */

#define UART_CR_RSTRX                (1 << 2)  /* Bit 2:  Reset Receiver */
#define UART_CR_RSTTX                (1 << 3)  /* Bit 3:  Reset Transmitter */
#define UART_CR_RXEN                 (1 << 4)  /* Bit 4:  Receiver Enable */
#define UART_CR_RXDIS                (1 << 5)  /* Bit 5:  Receiver Disable */
#define UART_CR_TXEN                 (1 << 6)  /* Bit 6:  Transmitter Enable */
#define UART_CR_TXDIS                (1 << 7)  /* Bit 7:  Transmitter Disable */
#define UART_CR_RSTSTA               (1 << 8)  /* Bit 8:  Reset Status Bits */
#define UART_CR_STTBRK               (1 << 9)  /* Bit 9:  Start Break */
#define UART_CR_STPBRK               (1 << 10) /* Bit 10: Stop Break */
#define UART_CR_STTTO                (1 << 11) /* Bit 11: Start Time-out */
#define UART_CR_SENDA                (1 << 12) /* Bit 12: Send Address */
#define UART_CR_RSTIT                (1 << 13) /* Bit 13: Reset Iterations */
#define UART_CR_RSTNACK              (1 << 14) /* Bit 14: Reset Non Acknowledge */
#define UART_CR_RETTO                (1 << 15) /* Bit 15: Rearm Time-out */
#define UART_CR_DTREN                (1 << 16) /* Bit 16: Data Terminal Ready Enable */
#define UART_CR_DTRDIS               (1 << 17) /* Bit 17: Data Terminal Ready Disable */
#define UART_CR_RTSEN                (1 << 18) /* Bit 18: Request to Send Enable */
#define UART_CR_FCS                  (1 << 18) /* Bit 18: Force SPI Chip Select */
#define UART_CR_RTSDIS               (1 << 19) /* Bit 19: Request to Send Disable */
#define UART_CR_RCS                  (1 << 19) /* Bit 19: Release SPI Chip Select */
#define UART_CR_LINABT               (1 << 20) /* Bit 20: Abort LIN Transmission */
#define UART_CR_LINWKUP              (1 << 21) /* Bit 21: Send LIN Wakeup Signal */

/* USART Mode Register */

#define UART_MR_MODE_SHIFT           (0)       /* Bits 0-3: */
#define UART_MR_MODE_MASK            (15 << UART_MR_MODE_SHIFT)
#  define UART_MR_MODE_NORMAL        (0  << UART_MR_MODE_SHIFT) /* Normal */
#  define UART_MR_MODE_RS485         (1  << UART_MR_MODE_SHIFT) /* RS485 */
#  define UART_MR_MODE_HWHS          (2  << UART_MR_MODE_SHIFT) /* Hardware Handshaking */
#  define UART_MR_MODE_ISO7816_0     (4  << UART_MR_MODE_SHIFT) /* IS07816 Protocol: T = 0 */
#  define UART_MR_MODE_ISO7816_1     (6  << UART_MR_MODE_SHIFT) /* IS07816 Protocol: T = 1 */
#  define UART_MR_MODE_IRDA          (8  << UART_MR_MODE_SHIFT) /* IrDA */
#  define UART_MR_MODE_SPIMSTR       (14 << UART_MR_MODE_SHIFT) /* SPI Master */
#  define UART_MR_MODE_SPISLV        (15 << UART_MR_MODE_SHIFT) /* SPI Slave */
#define UART_MR_USCLKS_SHIFT         (4)       /* Bits 4-5: Clock Selection */
#define UART_MR_USCLKS_MASK          (3 << UART_MR_USCLKS_SHIFT)
#  define UART_MR_USCLKS_USART       (0 << UART_MR_USCLKS_SHIFT) /* CLK_USART */
#  define UART_MR_USCLKS_USARTDIV    (0 << UART_MR_USCLKS_SHIFT) /* CLK_USART/DIV(1) */
#  define UART_MR_USCLKS_CLK         (0 << UART_MR_USCLKS_SHIFT) /* CLK */
#define UART_MR_CHRL_SHIFT           (6)       /* Bits 6-7: Character Length */
#define UART_MR_CHRL_MASK            (3 << UART_MR_CHRL_SHIFT)
#  define UART_MR_CHRL_5BITS         (0 << UART_MR_CHRL_SHIFT) /* 5 bits */
#  define UART_MR_CHRL_6BITS         (1 << UART_MR_CHRL_SHIFT) /* 6 bits */
#  define UART_MR_CHRL_7BITS         (2 << UART_MR_CHRL_SHIFT) /* 7 bits */
#  define UART_MR_CHRL_8BITS         (3 << UART_MR_CHRL_SHIFT) /* 8 bits */
#define UART_MR_SYNC                 (1 << 8)  /* Bit 8: Synchronous Mode Select */
#define UART_MR_CPHA                 (1 << 8)  /* Bit 8: SPI Clock Phase */
#define UART_MR_PAR_SHIFT            (9)       /* Bits 9-11: Parity Type */
#define UART_MR_PAR_MASK             (7 << UART_MR_PAR_SHIFT)
#  define UART_MR_PAR_EVEN           (0 << UART_MR_PAR_SHIFT) /* Even parity */
#  define UART_MR_PAR_ODD            (1 << UART_MR_PAR_SHIFT) /* Odd parity */
#  define UART_MR_PAR_SPACE          (2 << UART_MR_PAR_SHIFT) /* Space: parity forced to 0 */
#  define UART_MR_PAR_MARK           (3 << UART_MR_PAR_SHIFT) /* Mark: parity forced to 1 */
#  define UART_MR_PAR_NONE           (4 << UART_MR_PAR_SHIFT) /* No parity */
#  define UART_MR_PAR_MULTIDROP      (6 << UART_MR_PAR_SHIFT) /* Multidrop mode */
#define UART_MR_NBSTOP_SHIFT         (12)      /* Bits 12-13: Number of Stop Bits */
#define UART_MR_NBSTOP_MASK          (3 << UART_MR_NBSTOP_SHIFT)
#  define UART_MR_NBSTOP_1           (0 << UART_MR_NBSTOP_SHIFT) /* 1 stop bit 1 stop bit */
#  define UART_MR_NBSTOP_1p5         (1 << UART_MR_NBSTOP_SHIFT) /* 1.5 stop bits */
#  define UART_MR_NBSTOP_2           (2 << UART_MR_NBSTOP_SHIFT) /* 2 stop bits 2 stop bits */
#define UART_MR_CHMODE_SHIFT         (14)      /* Bits 14-15: Channel Mode */
#define UART_MR_CHMODE_MASK          (3 << UART_MR_CHMODE_SHIFT)
#  define UART_MR_CHMODE_NORMAL      (0 << UART_MR_CHMODE_SHIFT) /* Normal Mode */
#  define UART_MR_CHMODE_ECHO        (1 << UART_MR_CHMODE_SHIFT) /* Automatic Echo */
#  define UART_MR_CHMODE_LLPBK       (2 << UART_MR_CHMODE_SHIFT) /* Local Loopback */
#  define UART_MR_CHMODE_RLPBK       (3 << UART_MR_CHMODE_SHIFT) /* Remote Loopback */
#define UART_MR_MSBF                 (1 << 16) /* Bit 16: Most Significant Bit first */
#define UART_MR_CPOL                 (1 << 16) /* Bit 16: SPI Clock Polarity */
#define UART_MR_MODE9                (1 << 17) /* Bit 17: 9-bit Character Length */
#define UART_MR_CLKO                 (1 << 18) /* Bit 18: Clock Output Select */
#define UART_MR_OVER                 (1 << 19) /* Bit 19: Oversampling Mode */
#define UART_MR_INACK                (1 << 20) /* Bit 20: Inhibit Non Acknowledge */
#define UART_MR_DSNACK               (1 << 21) /* Bit 21: Disable Successive NACK */
#define UART_MR_VARSYNC              (1 << 22) /* Bit 22: Variable Synchronization of Command/Data Sync Start Frame Delimiter */
#define UART_MR_INVDATA              (1 << 23) /* Bit 23: INverted Data */
#define UART_MR_MAXITER_SHIFT        (24)      /* Bits 24-26: Max iterations (ISO7816 T=0 */
#define UART_MR_MAXITER_MASK         (7 << UART_MR_MAXITER_SHIFT)
#define UART_MR_FILTER               (1 << 28) /* Bit 28: Infrared Receive Line Filter */
#define UART_MR_MAN                  (1 << 29) /* Bit 29: Manchester Encoder/Decoder Enable */
#define UART_MR_MODSYNC              (1 << 30) /* Bit 30: Manchester Synchronization Mode */
#define UART_MR_ONEBIT               (1 << 31) /* Bit 31: Start Frame Delimiter Selector */

/* USART Interrupt Enable Register, USART Interrupt Disable Register, USART Interrupt Mask
 * Register, and USART Status Register common bit field definitions.
 *
 * - Bits that provide interrupts with UART_INT_
 * - Bits unique to the USART status register begin with UART_SR_
 */
#define UART_INT_RXRDY               (1 << 0)  /* Bit 0:  RXRDY Interrupt */
#define UART_INT_TXRDY               (1 << 1)  /* Bit 1:  TXRDY Interrupt */
#define UART_INT_RXBRK               (1 << 2)  /* Bit 2:  Break Received/End of Break */
#define UART_INT_OVRE                (1 << 5)  /* Bit 5:  Overrun Error Interrupt */
#define UART_INT_FRAME               (1 << 6)  /* Bit 6:  Framing Error Interrupt */
#define UART_INT_PARE                (1 << 7)  /* Bit 7:  Parity Error Interrupt */
#define UART_INT_TIMEOUT             (1 << 8)  /* Bit 8:  Time-out Interrupt */
#define UART_INT_TXEMPTY             (1 << 9)  /* Bit 9:  TXEMPTY Interrupt */
#define UART_INT_ITER                (1 << 10) /* Bit 10: Iteration Interrupt */
#define UART_INT_UNRE                (1 << 10) /* Bit 10: SPI Underrun Error Interrupt */
#define UART_INT_RXBUFF              (1 << 12) /* Bit 12: Buffer Full Interrupt */
#define UART_INT_NACK                (1 << 13) /* Bit 13: Non Acknowledge Interrupt */
#define UART_INT_LINBK               (1 << 13) /* Bit 13: LIN Break */
#define UART_INT_LINID               (1 << 14) /* Bit 14: LIN Identifier */
#define UART_INT_LINTC               (1 << 15) /* Bit 15: LIN Transfer Completed */
#define UART_INT_RIIC                (1 << 16) /* Bit 16: Ring Indicator Input Change Flag */
#define UART_INT_DSRIC               (1 << 17) /* Bit 17: DSR Input Change Flag */
#define UART_INT_DCDIC               (1 << 18) /* Bit 18: DCD Input Change Flag */
#define UART_INT_CTSIC               (1 << 19) /* Bit 19: CTS Input Change Interrupt */
#define UART_SR_RI                   (1 << 20) /* Bit 20: Image of RI Input (Status only) */
#define UART_SR_DSR                  (1 << 21) /* Bit 21: Image of DSR Input (Status only) */
#define UART_SR_DCD                  (1 << 22) /* Bit 22: Image of DCD Input (Status only) */
#define UART_SR_CTS                  (1 << 23) /* Bit 23: Image of CTS Input (Status only) */
#define UART_SR_LINBLS               (1 << 23) /* Bit 23: ILIN Bus Line Status (Status only) */
#define UART_INT_MANE                (1 << 24) /* Bit 24: Manchester Error Interrupt */
#define UART_INT_LINBE               (1 << 25) /* Bit 25: LIN Bit Error */
#define UART_INT_LINISFE             (1 << 26) /* Bit 26: LIN Inconsistent Sync Field Error */
#define UART_INT_LINIPE              (1 << 27) /* Bit 27: LIN Identifier Parity Error */
#define UART_INT_LINCE               (1 << 28) /* Bit 28: LIN Checksum Error */
#define UART_INT_LINSNRE             (1 << 29) /* Bit 29: LIN Slave Not Responding Error */
#define UART_INT_LINSTE              (1 << 30) /* Bit 30: LIN Sync Tolerance Error */
#define UART_INT_LINHTE              (1 << 31) /* Bit 31: LIN Header Time-out Error */

#define UART_INT_ALLINTS             0xff0ff7e7

